      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 phone_number PIC 
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           display address1.
           move "12345" to address1.
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
