       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM_NAME.
       AUTHOR. Aye Min Tun.
       DATE-WRITTEN. 2026-05-13.
       
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "Hello, World!".
           STOP RUN.
       END PROGRAM PROGRAM_NAME.
        