       identification division.
       program-id. test_progam.
       data division.
       working-storage section.
       procedure division.
       main-procedure.
            display "Hello World".
            stop run.
       end program test_progam.