       01 ACCOUNT-RECORD.
           05 ACCOUNT-NUMBER PIC 9(10) BLANK WHEN ZERO.
           05 ACCOUNT-HOLDER-NAME PIC A(20).
           05 ACCOUNT-BALANCE PIC 9(7)V99.
           05 SALARY PIC 9(5) VALUE 12.
