       01 Employee-Record.
           05 Employee-id PIC 9(5).
           05 Employee-name PIC A(10) VALUE "AKSO".
           05 Employee-salary PIC 9(7)V99.
